https://github.com/okovtun/BD_011
https://www.youtube.com/watch?v=JcxXWXfzvh0&list=PLeqyOOqxeiIOAV6jwf66i0qm7tLMGSQZn&index=1&t=1316s

TOREAD:
http://cplusplus.com/doc/tutorial/control/

TODO:
Написать программу 3Dshooter, которая выводит на экран действие пользователя, в зависимости от нажатой клавиши:
w - вперед
s - назад
a - влево
d - вправо
space - прыжок
enter - огонь
escape - выход.

DONE:
Пользователь вводит число, а программа говорит, введенное число Палиндром, или нет.
12321
1221
223353322
5

DONE:
0. Пользователь вводит число. Если это число в промежутке от 0 до 10, программа выдает "Вы попали", в противном случае - "Вы промазали".
1. Написать программу для тестирования на 5 вопросов, по 4 варианта ответа. Варианты ответа обозначаются буквами ABCD. Если пользователь ответил на вопрос правильно, то программа ему об этом говорит, и добавляет один бал, в противном случае, программа просто говорит, что ответ неправильный, и задается следующий вопрос.

На какой планете мы живем?
A. Меркурий;
B. Венера;
C. Земля;
D. Марс;
Ваш ответ: _

2. Написать программу "Калькулятор", которая умеет вычислять выражения вида 2+3
	2+3=5;

DONE:
Что будет выведено на экран:

----------------------------- 1 --------------------------------

int i = 3;
i = ++i + ++i;
cout << i << endl;

----------------------------- 2 --------------------------------

int i = 3;
i = i++ + ++i;
cout << i << endl;

----------------------------- 3 --------------------------------

int i = 3;
i = i++ + 1 + ++i * 2;
cout << i << endl;

----------------------------- 4 --------------------------------

int i = 3;
i = i++ + 1 + ++i *= 2;
cout << i << endl;

----------------------------- 5 --------------------------------

int i = 3;
i += i++ + 1 + ++i *= 2;
cout << i << endl;