/*
Написать программу 3Dshooter, которая выводит на экран действие пользователя, в зависимости от нажатой клавиши :
w - вперед
s - назад
a - влево
d - вправо
space - прыжок
enter - огонь
escape - выход.
*/

#include <iostream>
#include <conio.h> //Console Input Output header
using namespace std;

#define Esc 27

void main()
{
	setlocale(LC_ALL, "Russian");


	char key;
	int i = 0; //Кличество итераций

	int step = 0, jump = 0, fire = 0;

	do
	{
		i++;
		if (i == 1) //Каждый раз если i=1, выводить на экран меню.
		{
			system("cls");
			cout << "\t =========+=========+=========+=========+=========+========= \n";
			cout << "\t|                      << 3D shuter >>                      |\n";
			cout << "\t|-----------------------------------------------------------|\n";
			cout << "\t| ________                                                  |\n";
			cout << "\t|| Escape |                                                 |\n";
			cout << "\t|| выход  |                                                 |\n";
			cout << "\t|                   Управление персонажем:                  |\n";
			cout << "\t|             ________                                      |\n";
			cout << "\t|            |   w    |                                 ___ |\n";
			cout << "\t|            | вперёд |                                |   ||\n";
			cout << "\t| ________    ________    ________                 ____|   ||\n";
			cout << "\t||   a    |  |   s    |  |   d    |               | Enter  ||\n";
			cout << "\t|| влево  |  | назад  |  | вправо |               | огонь  ||\n";
			cout << "\t|          _______________________________________          |\n";
			cout << "\t|         |                 Space                 |         |\n";
			cout << "\t|                           прыжок                          |\n";
			cout << "\t =========+=========+=========+=========+=========+========= \n";
			cout << "\t   Нажимайте клавишу действия персонажа\n";
		}
		else if (i == 10) //Каждые десять действий сбрасывать счетчик на ноль. При следующей итерации очищается экран, выводится меню.
		{
			i = 0;
		}

		key = _getch();

		switch ((int)key)
		{
		case 119: // - w
		{
			cout << "\t/\\ Вперёд /\\\n";
			step++; // + шаг
			break;
		}
		case 97: // - a
		{
			cout << "\t<< Влево <<\n";
			step++; // + шаг
			break;
		}
		case 115: // - s
		{
			cout << "\t\\/ Назад \\/\n";
			step++; // + шаг
			break;
		}
		case 100: // - d
		{
			cout << "\t>> Вправо >>\n";
			step++; // + шаг
			break;
		}
		case 13: // - Enter
		{
			cout << "\t** Огонь! **\n";
			fire++; // + выстрел
			break;
		}
		case 32: // - Space
		{
			cout << "\t^^ Прыжок ^^\n";
			jump++; // + прыжок
			break;
		}
		default: //Нажата не зарегистрированная клавиша. Не считать как итерацию.
			i--;
			break;
		}
	} while (key != Esc);

	system("cls");
	cout << "\t =========+=========+=========+=========+=========+========= \n";
	cout << "\t|         За время работы программы персонаж совршил:       |\n";
	cout << "\t ----------------------------------------------------------- \n";
	cout << "\t               Шагов    - " << step << endl;
	cout << "\t               Прыжков  - " << jump << endl;
	cout << "\t               Высрелов - " << fire << endl;
	cout << "\t =========+=========+=========+=========+=========+========= \n\n";
	cout << "\t                       До новых встреч!\n\n";
}

//Исполнитель
/*
-----------------------------------------------------
|													|
|	"Компьютерная академия ШАГ"						|
|	Курс: БД011										|
|	Предмет: Основы програмирования на языке C++	|
|													|
|	Исполнитель: Курицын Алексей					|
|	Преподаватель: Ковтун Олег						|
|													|
|	Екатеринбург - 2020								|
|													|
-----------------------------------------------------
*/